{
  "_type": "news",
  "didUMean": "",
  "totalCount": 99,
  "relatedSearch": [],
  "value": [
    {
      "id": "2013456795171120783",
      "title": "Afghanistan: Joe Biden defends US pull-out as Taliban claim victory",
      "url": "https://news.yahoo.com/afghanistan-joe-biden-defends-us-211256151.html",
      "description": "Staying in Afghanistan was not an option, the US president says, as Taliban militants celebrate.",
      "body": "Joe Biden\n46th and current president of the United States\nUS President Joe Biden has defended his decision to withdraw US troops from Afghanistan - a move which led to Taliban militants returning to power.\nStaying longer was not an option, Mr Biden said in an address to the nation, a day after the end of a 20-year US presence in Afghanistan.\nHe praised troops for organising an airlift of more than 120,000 people wishing to flee the Taliban regime.\nThe Islamist militants have been celebrating what they call a victory.\nUS-led troops went into Afghanistan in 2001, ousting the Taliban in the wake of the devastating 9/11 attacks, blamed on al-Qaeda - a militant jihadist group then based in the Asian country.\nMr Biden has been widely criticised - at home and by his allies - over the abrupt manner of the US withdrawal, which led to the unexpected collapse of the Afghan security forces US troops had trained and funded for years.\nTaliban are back - what next for Afghanistan?\nTaliban militants were able to reclaim control of the whole country within 11 days - finally entering the capital, Kabul, on 15 August.\nPresident Biden deployed nearly 6,000 troops to seize control of the airport to co-ordinate the evacuation of US and allied foreign nationals and local Afghans who had been working for them.\nThousands of people converged on Kabul international airport in the hope of being able to board one of the evacuation flights.\nIn Tuesday's address, Mr Biden praised troops for the mass evacuation and promised to continue efforts to bring out those Americans who were still in Afghanistan and wanted to return - about 200 people altogether.\nBut the US leader strongly defended his move to pull out.\n\"I was not going to extend this forever war, and I was not extending a forever exit,\" Mr Biden said, adding: \"The war in Afghanistan is now over.\"\nHe said the US did not need troops on the ground to defend itself.\nAnalysis box by Anthony Zurcher, North America reporter\nJoe Biden tried to \"turn the page\" from a month of chaos and death in Afghanistan and, more broadly, from 20 years of ultimately futile US attempts at occupation and nation-building.\nStory continues\nAt times he seemed defensive, noting that Americans were warned 19 times to exit Afghanistan before the August US military withdrawal. He accused Afghan leaders, allies on whom the US had depended, of \"corruption and malfeasance\". And he blamed the Trump administration for negotiating what he characterised as an inadequate withdrawal agreement with the Taliban.\nHe said the US had no vital interest in Afghanistan, and tried to reframe US foreign policy as depending less on military deployments and more on diplomacy and international cooperation to face adversaries like China and Russia.\nPublic opinion polls show Americans still support the US withdrawal from Afghanistan, although many are unhappy with how Biden oversaw the exit. White House officials say they hope, as time passes, that the nation will be grateful for what the president accomplished and forget the details of how it ended.\nEvacuations since Taliban takeover\nBanner saying 'Get in touch'\nHave you been personally affected by the issues raised in this story? Tell us by emailing:\nhaveyoursay@bbc.co.uk\n.\nPlease include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:\nWhatsApp:",
      "snippet": "Staying in Afghanistan was not an option, the US president says, as Taliban militants celebrate.\n46th and current president of the United States.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2021-08-31T21:12:56",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s.yimg.com/ny/api/res/1.2/zkjjLqXNmd5ujMI2pgH5rQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/uu/api/res/1.2/e1.D6WtPTgHH1eljp065qQ--~B/aD0xMTUyO3c9MjA0ODthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/bbc_us_articles_995/8be9b821992f94d3d59320b985e6794b",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://news.yahoo.com/afghanistan-joe-biden-defends-us-211256151.html"
      }
    },
    {
      "id": "6611882712936636232",
      "title": "Biden speech on Afghanistan defends exit. Critics are wrong that it threatens Americans.",
      "url": "https://www.nbcnews.com/think/opinion/biden-speech-afghanistan-defends-exit-critics-are-wrong-it-threatens-ncna1278182",
      "description": "Biden speech on leaving Afghanistan defends exit even as Taliban surges and ISIS-K launches attacks. But critics are wrong that the withdrawal threatens Americans.",
      "body": "The Talibans conquest of Afghanistan is a disaster for many Afghans, but for Americans, it is mostly just upsetting: a cause of shame, sympathy and even trauma, but not insecurity. Afghanistans disaster is largely our fault, but there are good reasons to trust it will not follow us home. President Joe Biden was right when he defended ending the war Tuesday because the United States has no vital interest there, and to push back on critics who warn of impending catastrophe now that the last U.S. troops have been pulled out.\n\nThe idea that leaving Afghanistan, even messily, undermines U.S. credibility to fight elsewhere is basically backward.\n\nU.S. commentators lament the Talibans victory for three main national security reasons. One, leaving Afghanistan, especially in the way the troubled evacuation effort was handled, is supposedly such a blow to U.S. credibility that the alliances it supports will quake and adversaries will advance. Two, Russia or China will fill the vacuum left by U.S. forces, gaining influence as Central Asian states seek new protectors and wealth as the new Taliban government looks to make development deals. Three, the Taliban will again offer haven to Al Qaeda terrorists bent on attacking the U.S. or enable the Islamic State Khorasan group, or ISIS-K, terrorists  responsible for this weeks Kabul airport bombing  despite being at war with them.\n\nBut the idea that leaving Afghanistan, even messily, undermines U.S. credibility to fight elsewhere is basically backward. Having freed up some troops and funds, the U.S. ability to fight where it really matters is mildly enhanced. Having lingered two decades in a quagmire is testament to an excess of commitment to fight, not a lack of commitment. That Joe Biden, the third president to say he was going to end the war, did so pursuant to the Doha agreement then-President Donald Trump made with the Taliban, albeit a bit tardily, means the U.S. was actually honoring a commitment, not abandoning one. And if youre worried that the evacuation of Kabul hurt the U.S. reputation for competence, you must have missed the last 15 years of war; its long been gone.\n\nLuckily, however, history and common sense tell us that neither enemies nor allies will see Afghanistan as an exemplar. Studies show that U.S. allies and those who threaten them know that their local circumstances are profoundly different and judge the credibility of U.S. threats to fight there mostly by U.S. interests in and capability to do so. Sure, ministers in allied states kvetch about how the wars end damages American leadership and prestige. But thats because they liked Americans fighting a war they largely wouldnt. If they were really worried about U.S resolve to protect them, they would do more than complain; theyd take greater responsibility for their defense or capability to make war without U.S. help. They dont because U.S. credibility does not ricochet around the world like a pinball but rather follows from concrete U.S. interests.\n\nThe idea that leaving Afghanistan means opening a vacuum for rivals in a budding great power competition is even more flawed. For starters, the vacuum U.S. forces left was already filled  swiftly  by the Taliban. And as an impoverished state riven by mountains and well-armed rival sects, Afghanistan is more an occupational burden youd wish on your worst enemies than a prize. If its fabled mineral wealth were easily exploited, someone would have exploited it. And if it turns out the Chinese can extract mild profits from making infrastructure loans or Russia has greater diplomatic pull with the Taliban government and neighboring states, why should we mind? Maybe they can help Afghanistan develop or do more to keep its instability in check. Competitors pursuing their interests in Afghanistan dont necessarily contradict Americas aims, and they certainly dont erode the foundations of U.S. security  its wealth, military might and geography.\n\nThe most legitimate security reason stemming from the Taliban retaking Afghanistan is that they will again offer a haven to terrorists who target Americans, just as they provided Al Qaeda in the lead-up to 9/11. Some are already pointing to Thursdays terrorist attack that killed 13 U.S. service members and more than 100 Afghans as the beginning of this new front. But their assertion doesnt hold together. The Taliban are actually at war with ISIS-K, because of both a raw struggle for power and because the Taliban are focused on Afghanistan, not global jihad. The U.S. and the Taliban share the goal of suppressing ISIS-K, and the U.S. can do so most effectively by working with the Taliban toward that end. In fact, the U.S. has already done this, providing the Taliban with air support in battles against ISIS-K that helped hobble the group. Moreover, the Talibans military success suggests they will likely prove more able counterterrorists than the fallen Afghan government, which suffered over 100 ISIS-K attacks in recent years.\n\nThe Taliban do reportedly maintain nebulous ties to remnants of the Al Qaeda network. This is worth some worry and intelligence attention, but the absence of the terrorist attacks coming out of Afghanistan over the last 20 years, including the area the Taliban controlled, is not plain luck. A redux of the 1990s alliance between the Taliban and whatever remains of al Qaeda is unlikely due to U.S. capability and Taliban incentives.\n\nIf the Taliban fail to police terrorism in Afghanistan, the United States has proven to an excessive degree since 2001 that we have the will and capability to strike suspected anti-American terrorists wherever they are. Losing military bases and partners in Afghanistan will harm such operations but not stop them. We know this from over the horizon airstrikes (those that come from long distances without an existing ground presence of U.S. forces) and targeted raids against erstwhile Al Qaeda leader Osama bin Laden in Pakistan and ISIS leader Abu Bakr al-Baghdadi in Syria. Improved surveillance and strike capabilities, starting with drones, made anti-American terrorist bases nearly extinct.\n\nMoreover, Al Qaeda originally gained a haven in 1990s Afghanistan because the Taliban imprudently invited it there in hopes it would help with the civil war then underway. Now the Taliban, having lost power thanks to Al Qaedas actions and then fighting their way back into it over two decades, are unlikely to repeat that mistake. For one, they need things from foreign powers, like unfrozen funds that sponsoring terrorists will prevent. And they have an evident self-interest in not being bombed back into the hinterlands, which is what the U.S. would do if Al Qaeda rose again with their blessing. Maybe they learned nothing and will give what remains of Al Qaeda free rein anyway, but that requires believing their leaders are suicidal after years of pragmatism, evident in their dealings in Doha.\n\nFor the United States, the irony of the Talibans swift conquest of Afghanistan i",
      "snippet": "Biden speech on leaving Afghanistan defends exit even as Taliban surges and ISIS-K launches attacks.\nBut critics are wrong that the withdrawal threatens Americans.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2021-08-31T22:51:52",
      "provider": {
        "name": "nbcnews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/newscms/2021_35/3502795/210831-us-soldiers-afghanistan-al-1505.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nbcnews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nbcnews.com/think/opinion/biden-speech-afghanistan-defends-exit-critics-are-wrong-it-threatens-ncna1278182"
      }
    },
    {
      "id": "13404567741377544",
      "title": "Where could Cam Newton land after being released by Patriots? 9 NFL teams that make sense",
      "url": "https://sports.yahoo.com/where-could-cam-newton-land-194809280.html?src=rss",
      "description": "Cam Newton went from starter to discarded in New England after being released by the Patriots. Where could the former NFL MVP land next?",
      "body": "Who helped themselves the most in final tune-ups?\nBottom line, Cam can play. And whatever you might think of Newton's on- and off-field persona, none other than Belichick has unfailingly praised him since he first signed with New England right before training camp in 2020.\nWhich begs the inevitable question: Is there another viable NFL home waiting for Newton? The list of possibilities might be longer than you'd think ...\nNew England Patriots quarterback Cam Newton (1) celebrates after scoring a touchdown against the New York Jets during the third quarter at Gillette Stadium.\nAtlanta Falcons\nMatt Ryan, who won MVP honors the year after Newton, is the guy here ... for now. But the backup situation behind him is unsettled, as is Ryan's future beyond this season depending on what direction the Falcons take under their new leadership. Newton is an Atlanta native, and this would allow him to be home  and could allow him to get his foot in the door in 2022 if the team decides to trade Ryan, 36, and rebuild. Playing in Arthur Smith's run-heavy, double-tight offense would certainly seem to suit Newton, too.\nBaltimore Ravens\nThey got a really nice showing from backup QB Tyler Huntley (4 passing TDs, 1 rushing TD) in Saturday's 37-3 rout of Washington. But he's an unproven commodity for a team that has Super Bowl aspirations and a starter, Lamar Jackson, who's already had two bouts with COVID-19and, as far as we know, remains unvaccinated (like Newton). Though Newton would surely prefer another opportunity to start, he'd likely be a much better fallback than Huntley, Trace McSorley or last year's QB2, Robert Griffin III, for a team that wants to dabble more with an air attack but has thrived recently with a run-based approach that dovetails with Newton's style.\nBuffalo Bills\nAnother championship-caliber team ... and another one with COVID-19 issues  and whether that makes Newton an attractive insurance policy or not is a point worthy of debate. The Bills have veteran Mitchell Trubisky, who sparkled during his return to Chicagoon Aug. 21, on a one-year deal behind 2020 MVP runner-up Josh Allen. Yet Allen is often compared to a younger Newton, and the Bills organization has several key members  namely head coach Sean McDermott and general manager Brandon Beane  who were with Newton during his apex in Carolina. Not a perfect fit here for either party, but also an option neither should rule out.\nDallas Cowboys\nThe hashtag has already surfaced: #CamToDallas. Widely viewed as NFC East favorites entering this season, it's been an unsettling summer for the Cowboys as they manage QB Dak Prescott's tender throwing shoulder while hoping his surgically repaired ankle is ready for regular-season exposure. But if Prescott suffers setbacks on either front or simply shows in next week's regular-season kickoff at Tampa Baythat he's still a few weeks away, would you rather have Newton step in cold ... or hope untested Cooper Rushcan keep the team afloat?\nDenver Broncos\nA generally loaded roster stood by for months waiting to learn whether conservative Teddy Bridgewater would be the quarterback or gunslinging youngster Drew Lock. Bridgewater prevailed for now  but his name is penciled onto the depth chart. If the calendar reaches October, and Denver is once again being scuttled by poor play under center, Newton could become a reasonable option  even though he's never worked with offensive coordinator Pat Shurmur  for a team that should otherwise be relevant ... and at a time when coach Vic Fangio really needs to win some games.\nHouston Texans\nHere's what we know: New GM Nick Caserio, who was with Newton in New England last year, is pretty much signing every available free agent in the galaxy in order to log an evaluation for a franchise that's essentially in shambles. Would Houston be an attractive destination for Newton? If it means a chance to play given the Texans' most viable option seems to be Tyrod Taylor, welp, as they say, \"It is what it is.\"\nNew York Giants\nIf third-year QB Daniel Jones truly blossoms and stops turning the ball over  and he did serve up another terrible INT in the red zone Sunday against New England  Big Blue could be a factor in the NFC East. If not? GM Dave Gettleman, who held the same role with the Panthers when they reached Super Bowl 50 under Newton, may have to resort to desperate measures to save this team  and his own job. A backfield with Newton and RB Saquon Barkley might be enough for a successful salvage operation.\nSeattle Seahawks\nBarring injury, Russell Wilson is entrenched here ... for 2021 anyway. But if something happens to Wilson, it's unlikely backups Geno Smith and/or Sean Mannion are going to ride to the rescue of a team hoping for more than another NFC West crown. And beyond that, if Wilson actually does manage to talk his way out of Seattle in 2022, it stands to reason that soon-to-be-70-year-old coach Pete Carroll won't be highly interested in a rebuild. And as much as Wilson has accomplished in the Pacific Northwest, Carroll might even prefer to revert to an offense in 2022 that permits Cam to book rather than relying on Russ to cook.\nWashington Football Team\nLet's end at the beginning for Newton, who began his NFL career in 2011 with an offensive rookie of the year performance under then-rookie head coach Ron Rivera in Carolina. Rivera's now the boss in Washington, where he debuted last year with a surprise run to the NFC East title. He's now banking on 38-year-old journeyman Ryan Fitzpatrick, who's never taken a playoff snap, to take the WFT back to the playoffs  where Newton started seven games over four postseasons while with the Panthers. A match made in Ashburn? Would hardly be a shocker, especially if Fitzpatrick and Co. stumble out of the gate  and the September of lineup of opponents serves up the Giants, Chargers and Bills.\n***\nFollow USA TODAY Sports' Nate Davis on Twitter @ByNateDavis\nThis article originally appeared on USA TODAY:",
      "snippet": "Cam Newton went from starter to discarded in New England after being released by the Patriots.\nWhere could the former NFL MVP land next?.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2021-08-31T20:10:33",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s.yimg.com/ny/api/res/1.2/gT.5frHWiFO6nOcYo_8YiQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/OgdQ1iJD8g.S29DJRtjTYA--~B/aD0yODUwO3c9NDI3NDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/usa_today_sports_articles_558/165f06e72b1bae909e27801cd5a5de54",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://sports.yahoo.com/where-could-cam-newton-land-194809280.html?src=rss"
      }
    },
    {
      "id": "3064166957087715818",
      "title": "Mike Richards out as \"Jeopardy!\" executive producer",
      "url": "https://news.yahoo.com/mike-richards-jeopardy-executive-producer-183527099.html",
      "description": "Mike Richards will no longer serve as the executive producer of both \"Jeopardy!\" and \"Wheel of Fortune,\" after past insensitive comments he made on his...",
      "body": "The former Olympian attended the US Open in chic fashion.\n1h ago\nFamilies of slain Marines call Biden's conduct at ceremony 'disrespectful'\nMore family members of military service members killed in Thursday's attack in Afghanistan have come forward to blast President Joe Biden for what they called his \"selfish\" and \"disrespectful\" behavior when the bodies were brought back to the United States.\n4h ago\nMinn. family may be trapped as town declares their access road doesn't exist\nMORA, Minn.  The gravel road that Renee and Andy Crisman live on, the road they drive every day, has disappeared. The gravel is still there. But in the midst of a bitter struggle with local officials just outside this central Minnesota city, Hillman Township supervisors informed the Crismans earlier this month that, in their view, the road has ceased to exist. Now that it has been officially ...\n17h ago\nTrump Reveals His Master Plan for Afghanistan: We Shouldve Let It Rot\nFox BusinessDonald Trump has had a lot to say about how Joe Biden has mishandled the withdrawal from Afghanistanbut, when given the chance to explain what he would have done differently, Trumps master plan boiled down to leaving the country in smouldering ruins before leaving it forever.The ex-president appeared on Fox Business on Tuesday morning to get some things off his chest a day after the last U.S. troops left Afghanistan. During a curious rant about how he believes unnamed shadowy force\n4h ago",
      "snippet": "Mike Richards will no longer serve as the executive producer of both \"Jeopardy!\" and \"Wheel of Fortune,\" after past insensitive comments he made on his.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2021-08-31T18:35:27",
      "provider": {
        "name": "yahoo",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://s.yimg.com/ny/api/res/1.2/eu2y8n.fCcFYhyAFJBO2Ew--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/hd/cp-video-transcode/prod/2021-08/31/612e798133777a72b60449a2/612e798133777a72b60449a3_o_U_v2.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "yahoo",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://news.yahoo.com/mike-richards-jeopardy-executive-producer-183527099.html"
      }
    },
    {
      "id": "7865755950067297932",
      "title": "Some power may be restored to New Orleans on Wednesday, mayor says",
      "url": "https://www.nbcnews.com/news/us-news/some-power-may-restored-new-orleans-wednesday-mayor-says-n1278175",
      "description": "Two days after Hurricane Ida struck Louisiana, the mayor of New Orleans said Tuesday that some power may be restored beginning Wednesday night.",
      "body": "Two days after Hurricane Ida struck Louisiana, leaving hundreds of thousands of customers without power, the mayor of New Orleans said Tuesday that some power might be restored to the city beginning Wednesday.\n\nMayor LaToya Cantrell said there should be \"some level of transmission\" to New Orleans late Wednesday, but she cautioned that while the news meant \"significant progress\" was being made, it did not mean residents could expect the lights to immediately come on across the city.\n\n\"The first step is transmission, and there's been significant progress as it relates to that. The next step will be focusing on distribution lines. So we're getting closer. And it could mean we could see some level of electricity or light in the city come tomorrow night,\" she said. \"But, again, the expectation should not be, because it's not a real one, that the entire city would be lit on tomorrow evening.\"\n\nCantrell said she got the update from the state's major power company, Entergy, which said earlier Tuesday that it could take several days to complete its damage assessment and give customers an estimated timeline to restore power.\n\nIt is not clear whether some power could resume in the wider metropolitan area Wednesday.\n\nEntergy said early Tuesday that the hardest-hit areas should \"expect extended power outages lasting for weeks.\"\n\nSt. Charles Parish, an area west of New Orleans that was pummeled by the storm, could be without electricity for \"at least a month,\" local leaders said Tuesday morning.\n\nLouisiana Gov. John Bel Edwards expressed frustration at the prospect of lengthy power outages.\n\n\"I know I'm not satisfied with 30 days. The Entergy people aren't satisfied with 30 days. Nobody who's out there needing power is satisfied with that,\" he said at a news conference Tuesday. \"But I am mindful that we just had the strongest hurricane  at least tied for the strongest  that the state has ever experienced, and infrastructure has been damaged.\"\n\nThere were 840,000 customers without power in Louisiana and 25,000 outages in Mississippi at 11 a.m. local time Tuesday, Entergy said in a statement. The company said it had restored power to 85,000 customers after a full day assessing damage.\n\nMore than 20,000 linemen, vegetation crews and others are working to restore power, Edwards said. He and Entergy said getting power to critical infrastructure is a priority.\n\nEntergy said: \"Essential services such as hospitals, nursing homes, fire and police departments, and water systems are at the head of the restoration list, along with our equipment that supplies electricity to large numbers of customers. Then we will concentrate our resources on getting the greatest number of customers back the fastest.\"\n\nIda, which made landfall in southeast Louisiana as a Category 4 storm, took out all eight Entergy transmission lines that supply electricity to the New Orleans area, including Orleans, Jefferson, St. Bernard and Plaquemines parishes, as well as parts of St. Charles and Terrebonne parishes.\n\nEntergy said at least one large tower that spans the Mississippi River collapsed after it withstood Hurricane Katrina in 2005. The tower's conductor landed in the river, the company said. It was not clear whether the others suffered similar catastrophic damage.\n\nRamsey Green, New Orleans' deputy chief administrative officer for infrastructure, said at a news conference Tuesday that Entergy was assessing all eight transmission lines to determine whether any could be quickly returned to service.\n\nStorm debris from Hurricane Ida is cleaned up Tuesday in Ponchatoula, La. Sean Rayford / Getty Images\n\nJoshua Rhodes, a research associate with the Webber Energy Group at the University of Texas at Austin, said the 400-foot tower that fell, which held lines from one side of the Mississippi River to the other, could move \"massive amounts of power.\"\n\n\"That's a big piece of equipment, and if it has to be custom-built somewhere, that could take months to get back,\" he said.\n\nRhodes said the loss of the tower will affect the amount of power that can flow in or out of the area and that it \"could have a lasting impact, depending on how much they were counting on that line to be there to serve the load of the city.\"\n\nFor other towers that may need repairs, crews can replace parts or add splints if there are breaks somewhere but the towers are still standing, Rhodes said.\n\n\"They'll probably be able to keep it in service even if it has to be replaced later or something like that,\" he said.\n\nA power company employee works on a line Tuesday in Houma, La., after Hurricane Ida. David J. Phillip / AP\n\nRhodes said crews are likely to assess and fix the transmission sector as a priority and then address problems like trees that fell onto distribution lines and lines that snapped.\n\nHe said the timeline is \"really going to depend on how much damage was suffered by the transmission system, because you have to get that up before you can power the distribution network.\"\n\n\"If there's extensive damage in the transmission system, then that can take longer. If that is relatively easier to bring back, then probably a lot of people will get power sooner,\" he said.\n\nEven in that case, it could be a long time before everybody gets power back, he said, because of \"what they call 'the last mile work.'\"\n\n\"At the very end of the line, the very last customer, that type of thing. It takes a lot of time to do that,\" he said.",
      "snippet": "Two days after Hurricane Ida struck Louisiana, the mayor of New Orleans said Tuesday that some power may be restored beginning Wednesday night.\nTwo days after Hurricane Ida struck Louisiana, leaving hundreds of thousands of customers without power, the mayor of New Orleans said Tuesday that some power might be restored to the city beginning Wednesday.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2021-08-31T23:19:00",
      "provider": {
        "name": "nbcnews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/newscms/2021_35/3502822/210831-ida-power-lines-down-se-418p.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "nbcnews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.nbcnews.com/news/us-news/some-power-may-restored-new-orleans-wednesday-mayor-says-n1278175"
      }
    }
  ]
}
